<a href="https://colab.research.google.com/github/andrewhylee/colab-notebooks/blob/main/Top_25_pandas_tricks.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#Set up Stage
import pandas as pd
import numpy as np

drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')

orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')

stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

# 1 - Show installed versions

In [3]:
# show version of your pandas
pd.__version__

'1.1.3'

In [4]:
# show versions of all your dependencies
pd.show_versions()

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

INSTALLED VERSIONS
------------------
commit           : db08276bc116c438d3fdee492026f8223584c477
python           : 3.6.9.final.0
python-bits      : 64
OS               : Linux
OS-release       : 4.19.112+
Version          : #1 SMP Thu Jul 23 08:00:38 PDT 2020
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 1.1.3
numpy            : 1.18.5
pytz             : 2018.9
dateutil         : 2.8.1
pip              : 19.3.1
setuptools       : 50.3.2
Cython           : 0.29.21
pytest           : 3.6.4
hypothesis       : None
sphinx           : 1.8.5
blosc            : None
feather          : 0.4.1
xlsxwriter       : None
lxml.etree       : 4.2.6
html5lib         : 1.0.1
pymysql          : None
psycopg2         : 2.7.6.1 (dt dec pq3 ext lo64)
jinja2           : 2.11.2
IPython          : 5.5.0
pandas_datareader: 0.9.0
bs4              : 4.6.3
bottleneck       : 1.3.2
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.2.2
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 2.5.9
pandas_gbq       : 0.13.3
pyarrow          : 0.14.1
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.3.20
tables           : 3.4.4
tabulate         : 0.8.7
xarray           : 0.15.1
xlrd             : 1.1.0
xlwt             : 1.3.0
numba            : 0.48.0

# 2 - Create an Example DataFrame

In [5]:
# Method 1
df = pd.DataFrame({'col one': [100, 200], 'col two': [300, 400]})
df

   col one  col two
0      100      300
1      200      400

In [6]:
# Method 2
pd.DataFrame(np.random.rand(4,8))

          0         1         2  ...         5         6         7
0  0.215758  0.876869  0.746508  ...  0.602557  0.331746  0.315872
1  0.609970  0.827299  0.271864  ...  0.385419  0.329874  0.336432
2  0.397283  0.045078  0.735514  ...  0.028727  0.926348  0.602626
3  0.936072  0.036389  0.959339  ...  0.643627  0.767194  0.267456

[4 rows x 8 columns]

In [7]:
# Method 3
pd.DataFrame(np.random.rand(3,6), columns=['does', 'this', 'list', 'work', 'as', 'well'])

       does      this      list      work        as      well
0  0.460618  0.315602  0.857121  0.393420  0.748411  0.516354
1  0.015817  0.429390  0.670175  0.623751  0.068474  0.940578
2  0.962657  0.786151  0.456790  0.781154  0.451136  0.444466

# 3 - Rename Columns

In [8]:
df

   col one  col two
0      100      300
1      200      400

In [9]:
# Most flexible method - can rename just a few at a time
df = df.rename({'Date':'col_one', 'A': 'col_two'}, axis='columns')
df

   col one  col two
0      100      300
1      200      400

In [10]:
# Replace All Column names at once
df.columns=['col_1', 'col_2']
df

   col_1  col_2
0    100    300
1    200    400

In [11]:
# Just replace characters
df.columns = df.columns.str.replace('_' , " ")
df

   col 1  col 2
0    100    300
1    200    400

In [12]:
# Add prefix to column names
df.add_prefix("hello_")

   hello_col 1  hello_col 2
0          100          300
1          200          400

In [13]:
# Add suffix to column names
df.add_suffix("_goodbye")

   col 1_goodbye  col 2_goodbye
0            100            300
1            200            400

#4 - Reverse Row Order

In [14]:
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [15]:
drinks.loc[::-1].head()

       country  beer_servings  ...  total_litres_of_pure_alcohol      continent
192   Zimbabwe             64  ...                           4.7         Africa
191     Zambia             32  ...                           2.5         Africa
190      Yemen              6  ...                           0.1           Asia
189    Vietnam            111  ...                           2.0           Asia
188  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]

In [16]:
drinks.loc[::-1].reset_index(drop=True).head()
drinks.loc[::-1].reset_index(drop=False).head()
drinks.loc[::-1].reset_index(drop=False).head().columns.str.replace('index', 'Yo_mama')
#drinks.head()

Index(['Yo_mama', 'country', 'beer_servings', 'spirit_servings',
       'wine_servings', 'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

#5 - Reverse Column Order

In [17]:
drinks.loc[:, ::-1].head()

  continent  total_litres_of_pure_alcohol  ...  beer_servings      country
0      Asia                           0.0  ...              0  Afghanistan
1    Europe                           4.9  ...             89      Albania
2    Africa                           0.7  ...             25      Algeria
3    Europe                          12.4  ...            245      Andorra
4    Africa                           5.9  ...            217       Angola

[5 rows x 6 columns]

#6 - Select Columns by Data Type

In [18]:
# All datatypes
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [19]:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [20]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [21]:
drinks.select_dtypes(include=['number', 'object','category', 'datetime']).head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [22]:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

#7 - Converting Strings to Numbers

In [23]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-'],})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [24]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [25]:
df.astype({'col_one': 'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [26]:
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [27]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [28]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)

In [29]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

#8 - Reduce DataFrame Size

In [30]:
# They're designed to fit in memory - so sometimes need to reduce the size.
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [31]:
# 2 easy steps to reduce size during FILE READING PROCESS
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.info(memory_usage='deep')
small_drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 3.1+ KB

In [32]:
small_drinks.head()

   beer_servings continent
0              0      Asia
1             89    Europe
2             25    Africa
3            245    Europe
4            217    Africa

In [33]:
# Reduce size by CHANGING OBJECT TYPE TO CATEGORY TYPE
mydtypes = {'continent':'category'}
small_drinks2 = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols, dtype=mydtypes)
small_drinks2.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

#9 - Build a DataFrame from multiple files(row-wise)

In [42]:
pd.read_csv('data/stocks1.csv')

FileNotFoundError: ignored

In [35]:
# 13 - filter a dataframe by multiple categories

movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [36]:
movies[movies.genre.isin(['Action', 'Drama', 'Western'])]

     star_rating  ...                                        actors_list
3            9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
5            8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
6            8.9  ...  [u'Clint Eastwood', u'Eli Wallach', u'Lee Van ...
9            8.9  ...  [u'Brad Pitt', u'Edward Norton', u'Helena Bonh...
11           8.8  ...  [u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'...
..           ...  ...                                                ...
968          7.4  ...  [u'Ralph Fiennes', u'Juliette Binoche', u'Will...
970          7.4  ...  [u'Michael Douglas', u'Tobey Maguire', u'Franc...
972          7.4  ...  [u'Ryan Gosling', u'Michelle Williams', u'John...
973          7.4  ...  [u'Tobey Maguire', u'Charlize Theron', u'Micha...
976          7.4  ...  [u'Russell Crowe', u'Paul Bettany', u'Billy Bo...

[423 rows x 6 columns]

In [37]:
counts = movies.genre.value_counts()
counts

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: genre, dtype: int64

In [38]:
counts.nlargest(4)

Drama     278
Comedy    156
Action    136
Crime     124
Name: genre, dtype: int64

In [39]:
movies

     star_rating  ...                                        actors_list
0            9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1            9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3            9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4            8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....
..           ...  ...                                                ...
974          7.4  ...  [u'Dustin Hoffman', u'Jessica Lange', u'Teri G...
975          7.4  ...  [u'Michael J. Fox', u'Christopher Lloyd', u'Ma...
976          7.4  ...  [u'Russell Crowe', u'Paul Bettany', u'Billy Bo...
977          7.4  ...  [u'JoBeth Williams', u"Heather O'Rourke", u'Cr...
978          7.4  ...  [u'Charlie Sheen', u'Michael Douglas', u'Tamar...

[979 rows x 6 columns]

In [40]:
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000